[
  {
    "id": 1,
    "tags": "product",
    "location": "Umeå, Sweden",
    "date": "February 17, 2024",
    "header": "Doing design through building ideas.",
    "text": "Building helps me to gain clarity about the nature of a new idea. When designing things through making, the designer Camille Mousette distinguishes between the actions of sketching and prototyping: \"Sketches contribute back to its creator, while prototypes radiate outward to the others and the world\". * \n \n Early on sketches help to get understanding about the materiality of the given technology. ** They provoke a conversation with the material, due to their interactive nature. This conversation derives smaller sub-problems inhabiting the bigger over-arching initial idea. Those sub-problems often refine and concretise the initial idea, which retrospectively often is exposed as a vague direction. After exposing derived ideas and sketches to stakeholders, prototypes can be built that fuse insights of the sketches into interactive artefacts for further exposure. At this point flexibility in trajectory on the final interventions should be kept up to the latest point to exploit the maximum insight from the building process. If there is consensus about solutions the early prototypes provide a solid foundation to build product-like prototypes for outside communication. \n\n Concluding this quote by Stappers summarises the applied process for designing interactions: \"Functional artefacts are where ideas touch-down on earth, stop being theory and start becoming reality.\" ***",
    "resource": { "1": "Moussette, C. (2012). Simple Haptics: Sketching Perspectives for the Design of Haptic Interactions. Umeå Institute of Design Research Publications.", "2": "Redström, J. (2005). On Technology as Material in Design. In Willis, A-M. (ed.) Design Philosophy Papers: Collection Two, pp. 31-42. Team D/E/S Publications. ", "3": "Stappers, P. (2007). Doing Design as a Part of Doing Research." }
  }
]
