[ 
  {
    "id": 4,
    "tags": "work",
    "location": "Stockholm, Sweden",
    "date": "December 04, 2024",
    "header": "On design prototyping.",
    "text": "Last month, I visited San Francisco to meet some of my absolute design and prototyping heroes in person and try to learn as much as possible from them. The following are notes on things I have learned during my stay in the bay area. All of the observations were made through the lens of a prototyper. I hope they can be helpful to some people. \n\n##Twitter is (still) a Hive-Mind for the Tech-Industry.\n\n Exposure of work and ideas on Twitter connected me to like-minded individuals in tech in no time. Being courageous and proactive through exposing work will pay-off through forming connections and accelerating learning. If you are a designer/prototyper Twitter can be a powerful tool for feedback, validation and networking.\n\n##Prototypes as Memes.\n\nWhen it comes to sharing work on Twitter it is worked best for me to package them in quickly digestible 20–50 second videos with a short catchy but clear description. The video should have a short build up, followed by a climax moment. It turned out as not important to share details about implementation or inspiration.\n\n##More Clarity. More Impact.\n\nClarity of communication mirrors the purity of thoughts. The clearer the communication, the more impact it will have. This is true for presentation, conversation and portfolio. I learned that I need to be clearer on:\n\nMy stance in the spectrum between designer and prototyper.\nMy preferences concerning divergent or convergent processes.\nMy positioning within the field.My personal and career goals.\nMy vision for interfaces with technology.\nMy opinions on the state of technology.\nMy motivations behind my work.\n\nWords might not be the best format for conveying thoughts for everyone. Writing (without LLMs) however is a powerful tool for reaching more clarity as it exposes vague and cloudy thoughts and helps sharpening their underlying idea if consciously practiced.*\n\nEgo is the enemy of clarity because it manipulates thoughts in subtle often sub-conscious ways changing their goal from seeking truth and long-term growth to short-term gratification, defensiveness and comfort. The price of distraction is time. Distraction delays and inhibits the process of sense-making that is essential to forming clear thoughts.\n\nEgo invested thinking and bad attention hygiene should be avoided at all cost to uncover the truth behind ideas and communicate in clear, easy and understandable words.\n\n##Prototypes are Products of their Own.\n\nUsually a prototype in professional context is framed as a tool for testing the impact of a feature within a product through making it experienceable.\n\nHowever a prototype could be also seen as a product of its own with product-thinking directly applied to its creation. Its target-audience (with pain-points, problems and needs) are the people it is presented to. It strives to solve the problem of digging deeper into the meaning of a design idea and then communicate the insights. Every prototype also has a cost attached, namely the time invested to build it. The return-of-investment is a decision made because of it.\n\nApplying product-thinking to prototyping process itself can make it more targeted and efficient, its success measurable and provide data for improvement of future prototypes.\n\n##Survivorship Bias & Five-Why's.\n\nSurvivorship bias is a logical error in which attention is paid only to those entities that have survived a selective filter, which can lead to incorrect conclusions.* \n\nWhile analysing data gathered from usage of products, survivorship bias can lead to misinterpretation leading to wrong decisions on future features and directions. In prototyping survivorship bias can occur through not putting enough attention on defining the initial problem a prototype should solve. This can lead to a costly waste of time.\n\nA technique for preventing this bias is to use the 5-Whys method. Through 5 iterations of asking Why? on the current set of problems requiring prototyping. Once the root problem is uncovered it becomes much easier to formulate ideas that could solve it.* \n\n##Speed, Intelligence & Honesty in Implementation.\n\nLosing oneself in detailed technical implementation of interactions can slow-down the pace of prototyping.* A good question to ask is:\n\nWhat prototype is the least effort with the biggest impact?\n\nAs prototypers act on a spectrum between design and engineering being upfront on the intention and implementation of a prototype from design and engineering perspective helps team-members to understand the problem space it is aimed at solving.\n\n##Parametric Workflows.\n\nAn advantage of functional prototypes is that they are naturally procedural. Variables can be exposed through little additional UIs with sliders, toggles and colour-pickers. This makes the prototype itself a tool for team-mates to express their ideas. Those parametric workflows can be used for divergence and convergence of an idea depending on the stage of the project and the exposed parameters.\n\n##Room for Craft & Story-Telling differentiates Prototypes.\n\nThere is a purpose-driven part of the prototyping process and a taste-driven part. While the purpose-driven part revolves around building out functionalities fast to test them, the taste-driven part is the last mile of pushing a prototype to feel beautiful and refined.\n\nTime is constrained, which often leads to undervaluation of the taste-driven part in the process as it adds time beyond establishing the framework of interaction. The last 20% of crafting can have big returns though, through giving a touch-and-feel to the prototype that can be defining to its success in presentation. Factoring in time for this process will enable prototypes that ultimately lead to more beautiful interactions in the product feature they lay out.\n\nAs mentioned above it is not necessary to technically implement every little detail for efficient story-telling. Sometimes faking aspects of a prototype through video-making can be sufficient, after making up one's mind about what feels right through the building process.\n\n##Tools of Choice.\n\nThe choice of tools influences the outcome of the prototyping process. It is good practice to question tools of choice of implementation for every given prototype:\n\nDo technical choices support the initial goal/idea of a prototype?\nWhich traits of the prototype arise from the used tools?\nIs there another tool that allows to get closer to the exact vision?\n\nKeeping those questions in mind helps to understand if the tool of choice aligns with the initial vision for the prototype, rather than adding friction or diffracting the idea.\n\n##Coding as a Prototyper.\n\nCoding is more than a tool. It is the sequential thought-process behind building out interactive behaviours. Interaction could be framed as a flow of data between different functional entities. Prototyping code is different from production code. It is not as constrained by models and rules aimed at ensuring scalability, maintainability and modularity of a codebase as engineering code. It is rather aimed at accelerating and validating thoughts about interactions before engineering hours are invested into implementation.\n\nThe advent of LLMs foregrounded the idea that one can build everything they can think off. This conclusion introduces the risk of degrading the thought-process behind coding from a process of sense-making to an act of gambling. A question that should be constantly asked to gain immunity against this behaviour is:\n\nDo I understand what I build?\n\n##Learning from Engineers\n\nEven-though prototyping code has different goals then engineering code as defined above. Some practices established by engineers can help making prototypes snappy and lean and underlying code useful to form a mental model for implementation:\n\nEstablish rules for what is positioned where in your code.\nWrite code that is modular, re-usable, non-redundant and simple.\nSolving a problem is much easier, than finding the simplest solution.\nUsing features of IDEs safes time and helps to establish good practices.\nUnderstanding of concepts like springs, forces, acceleration, deceleration, velocity, tension and inertia can supercharge the motion behaviour of prototypes.\nWriting comments before handing of the code in a review with an engineer, will increase own understanding and learning through prototyping.\n\n##A Love-Letter to San Francisco.\n\nSan Francisco is the place of my dreams since I became interested in prototyping and that was confirmed in many ways during my visit. The culture of people who challenge their ideas through relentlessly building and exposing them to the public creates the highest concentration of intelligence, agency and beauty I have ever witnessed in a single location. I hope that one day I can be a part of this captivating community and re-locate there to contribute on-sight.\n\n##Acknowledgements\n\nI want to thank Shengzhi, Martin, Marisa, Jason, Alessio, Greg, John, Rob and all the other people I have met for generously taking time and  sharing their thoughts and experiences with me.",
    "resource": {
      "1": "Graham, P. (2024). Writes & Write-nots. https://paulgraham.com/writes.html",
      "2": "Wikipedia. (2024). Survivorship bias. https://en.wikipedia.org/wiki/Survivorship_bias",
      "3": "Wikipedia. (2024). The 5-Why Method. https://en.wikipedia.org/wiki/Five_whys",
      "4": "Houde, S., & Hill, C. (1997). What do prototypes prototype?. Apple Computer, Inc."
    }
  },
  {
    "id": 3,
    "tags": "work",
    "location": "Stockholm, Sweden",
    "date": "October 16, 2024",
    "header": "Scoping for craft.",
    "text": "Prototypes need to have a fidelity that makes them desirable. Scoping the message a prototype should convey precisely enough for being able to craft it to a level were it becomes desirable is key. A good guidline for me is to take baby steps towards the goal. Too high expectations in the message of a single prototype or the own skills often can lead to unhappiness with the result. Small prototypes with the right message and a high-level of craft can have a lot more impact then holistic unfinished one's.",
    "resource": {
      "1": "First-hand experience."
    }
  },
  {
    "id": 2,
    "tags": "ethics",
    "location": "Umeå, Sweden",
    "date": "March 17, 2024",
    "header": "Sharing perspectives on virtual objects in the world.",
    "text": "Physical co-location of humans leads to non-verbal data exchange between people about their surroundings. Software experienced through non-spatial outlets creates presence isolated from our physical surroundings. Multi-player games, communication- and collaborative platforms are connecting people. This happens in an abstracted space. Co-located mixed reality changes this. It allows for direct experience and manipulation of virtual objects from different perspectives in the same physical space. This enhances the meaning of those objects through perceiving the response of others to them. Togetherness* in mixed reality removes scenarios of isolation and emphasises exchange and collaboration between people. Its value should be considered when designing spatial experiences.",
    "resource": {
      "1": "Kuenen, C. (2018). Aesthetics of Being Together. Umeå Institute of Design Research Publications."
    }
  },
  {
    "id": 1,
    "tags": "process",
    "location": "Umeå, Sweden",
    "date": "February 17, 2024",
    "header": "Doing design through building ideas.",
    "text": "Building helps one to gain clarity about the nature of a new idea. When designing things through making the actions of sketching and prototyping are applied: \"Sketches contribute back to its creator, while prototypes radiate outward to the others and the world\".\n\nEarly on sketches help to gain understanding about the materiality of the given technology. They provoke a conversation with the material because of their interactive nature. This process derives smaller problems inhabiting the bigger idea. It also refines and concretises the initial idea, which retrospectively often is exposed as more of a vague direction. After showing sketches to stakeholders, prototypes can fuse insights of the sketches into interactive artefacts for precise communication. Flexibility in trajectory on the final interventions is important up to the latest point to exploit the maximum insight from the building process. When clarity of mind is reached early prototypes provide a solid foundation to build more refined prototypes for outside communication.\n\nThis quote by Stappers summarises the applied process for designing interactions well: \"Functional artefacts are where ideas touch-down on earth, stop being theory and start becoming reality.\"",
    "resource": {
      "1": "Moussette, C. (2012). Simple Haptics: Sketching Perspectives for the Design of Haptic Interactions. Umeå Institute of Design Research Publications.",
      "2": "Redström, J. (2005). On Technology as Material in Design. In Willis, A-M. (ed.) Design Philosophy Papers: Collection Two, pp. 31-42. Team D/E/S Publications.",
      "3": "Stappers, P. (2007). Doing Design as a Part of Doing Research."
    }
  }
]
