[
  {
    "id": 3,
    "tags": "work",
    "location": "Stockholm, Sweden",
    "date": "October 16, 2024",
    "header": "Craft, taste & persistence.",
    "text": "Craft. Knowledge generated from first-hand experiences is essential in understanding the true nature of design ideas. This is achievable through building functional prototypes that can be played with. These prototypes need to have a fidelity that makes them desirable. Scoping the message a prototype should convey precisely enough for being able to craft it to a level were it becomes desirable is key. Too high expectations in the message of a single prototype or the own skills often can lead to unhappiness with the result. Small prototypes with the right message and a high-level of craft can have a lot more impact then holistic unfinished one's. \n\nTaste. Not only good technical solutions beatiful one's. Many domains (Mathematicians, Scientists, Artists) call their work beatiful. Taste is not subjective. This can be feld as a designer when looking at old works and getting the feeling of cringe. Interest in culture and arts. Good design is simple. When you're forced to be simple, you're forced to face the real problem. When you can't deliver ornament, you have to deliver substance. Good design is timeless.  If something is ugly, it can't be the best solution. There must be a better one, and eventually someone will discover it. Good design solves the right problem. Problems can be improved as well as solutions. Good design is suggestive. Objects should be designed in a way that they should let you use it how you want not how they dictate it. Good design is hard. \n\nPersistence.",
    "resource": {
      "1": "https://paulgraham.com/taste.html",
      "2": "https://paulgraham.com/goodtaste.html"
    }
  },
  {
    "id": 2,
    "tags": "ethics",
    "location": "Umeå, Sweden",
    "date": "March 17, 2024",
    "header": "Sharing perspectives on virtual objects in the world.",
    "text": "Physical co-location of humans leads to non-verbal data exchange between people about their surroundings. Software experienced through non-spatial outlets creates presence isolated from our physical surroundings. Multi-player games, communication- and collaborative platforms are connecting people. This happens in an abstracted space. Co-located mixed reality changes this. It allows for direct experience and manipulation of virtual objects from different perspectives in the same physical space. This enhances the meaning of those objects through perceiving the response of others to them. Togetherness* in mixed reality removes scenarios of isolation and emphasises exchange and collaboration between people. Its value should be considered when designing spatial experiences.",
    "resource": {
      "1": "Kuenen, C. (2018). Aesthetics of Being Together. Umeå Institute of Design Research Publications."
    }
  },
  {
    "id": 1,
    "tags": "process",
    "location": "Umeå, Sweden",
    "date": "February 17, 2024",
    "header": "Doing design through building ideas.",
    "text": "Building helps one to gain clarity about the nature of a new idea. When designing things through making the actions of sketching and prototyping are applied: \"Sketches contribute back to its creator, while prototypes radiate outward to the others and the world\".\n\nEarly on sketches help to gain understanding about the materiality of the given technology. They provoke a conversation with the material because of their interactive nature. This process derives smaller problems inhabiting the bigger idea. It also refines and concretises the initial idea, which retrospectively often is exposed as more of a vague direction. After showing sketches to stakeholders, prototypes can fuse insights of the sketches into interactive artefacts for precise communication. Flexibility in trajectory on the final interventions is important up to the latest point to exploit the maximum insight from the building process. When clarity of mind is reached early prototypes provide a solid foundation to build more refined prototypes for outside communication.\n\nThis quote by Stappers summarises the applied process for designing interactions well: \"Functional artefacts are where ideas touch-down on earth, stop being theory and start becoming reality.\"",
    "resource": {
      "1": "Moussette, C. (2012). Simple Haptics: Sketching Perspectives for the Design of Haptic Interactions. Umeå Institute of Design Research Publications.",
      "2": "Redström, J. (2005). On Technology as Material in Design. In Willis, A-M. (ed.) Design Philosophy Papers: Collection Two, pp. 31-42. Team D/E/S Publications.",
      "3": "Stappers, P. (2007). Doing Design as a Part of Doing Research."
    }
  }
]
