[
  {
    "id": 1,
    "tags": "product",
    "location": "London, United Kingdom",
    "date": "August 06, 2022",
    "header": "Building my own tools.",
    "text": "A blog post by Kevin Andersson¹  made me reflect on the impact of tools on creation. The tools we use form our relationship with our work and influence its outcome.\n\nThere are softwares that give you the possibility to execute certain tasks in a uniform manner, usually in a rather precise way. What you put in is what you get out not more not less. Examples can be found in CAD tools such as Solidworks and Rhino or pixel and vector manipulation software like Photoshop, Illustrator and Figma.\n\nOpposing to those there are tools that force you into creating mental models for your creation. Examples for those are all sorts of graph based editors (Unity's shader and VFX graph, Blender's geometry & material-nodes, Grasshopper, Origami...), programming languages and libraries (Javascript, React, Framer Motion) and prototyping platforms like Arduino and Rasperry Pi.\nCreating mental models means an initial time investement into figuring out underlying principles and logic. This leads to a delay in output, which can be frustrating but pays of on the long-term for several reasons.",
    "resource": { "01": "sideprojects", "02": "", "03": "" }
  },
  {
    "id": 2,
    "tags": "product",
    "location": "Karberg, Austria",
    "date": "August 06, 2022",
    "header": "Dare to be under-qualified!",
    "text": "Ferner gibt es auch niemanden, der den Schmerz um seiner selbst willen liebt, der ihn sucht und haben will, einfach, weil es Schmerz ist.",
    "resource": { "01": "", "02": "", "03": "" }
  },
  {
    "id": 3,
    "tags": "product",
    "location": "San Francisco, United States",
    "date": "August 06, 2022",
    "header": "My new portfolio.",
    "text": "Ferner gibt es auch niemanden, der den Schmerz um seiner selbst willen liebt, der ihn sucht und haben will, einfach, weil es Schmerz ist.",
    "resource": { "01": "", "02": "", "03": "" }
  }
]
